Revit 2027 API
PreviewControl.UIView Property
The UI view representing the preview view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UIView UIView { get; }
Public ReadOnly Property UIView As UIView
	Get
public:
property UIView^ UIView {
	UIView^ get ();
}
member UIView : UIView with get
Property Value
UIView
Remarks
Use this handle to manipulate the zoom and pan of the view.
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace